
//подключение драйвера L298N 

#define LED_R 11 // Pin D5 --> красный
#define LED_G 10 // Pin D6 --> зеленый
#define LED_B 9 // Pin D3 --> синий

int red();
int green();
int blue();

void setup ()  {

 pinMode( LED_R, OUTPUT );
 pinMode( LED_G, OUTPUT );
 pinMode( LED_B, OUTPUT );
 analogWrite (LED_R,255);
 analogWrite (LED_G,255);
 analogWrite (LED_B,255);

}

void loop ()  { 
//-------------------------------------------------------------------------------------------//
//                                                                                           //
//                   Это основной цикл нашей программы!!!                                    //
//                                                                                           //
//-------------------------------------------------------------------------------------------//
 
//-------------зажигаем и гасим красный
{
  int x = 1;
  for (int i = 0; i > -1; i = i + x){
      red(i);
      if (i == 255) x = -1;             // переключение в сторону гашения на максимуме
      delay(5);
   }
}
//-------------зажигаем и гасим зеленый
{
  int x = 1;
  for (int i = 0; i > -1; i = i + x){
      green(i);
      if (i == 255) x = -1;             // переключение в сторону гашения на максимуме
      delay(5);
   }
}
//-------------зажигаем и гасим синий
{
  int x = 1;
  for (int i = 0; i > -1; i = i + x){
      blue(i);
      if (i == 255) x = -1;             // переключение в сторону гашения на максимуме
      delay(5);
   }
}

//-------------подмигиваеи каждым цветом по три раза
red(0);
delay(100);
red(80);
delay(100);
red(0);
delay(100);
red(160);
delay(100);
red(0);
delay(100);
red(255);
delay(100);
red(0);
delay(100);
green(80);
delay(100);
green(0);
delay(100);
green(160);
delay(100);
green(0);
delay(100);
green(255);
delay(100);
green(0);
delay(100);
blue(80);
delay(100);
blue(0);
delay(100);
blue(160);
delay(100);
blue(0);
delay(100);
blue(255);
delay(100);
blue(0);
//-------------мигаем случайными цветами со случайной яркостью
   for (int i=0; i <= 50; i++){
int color=(random(3)+1);
if (color=1) {red(random(256)); delay(100);red(0);}
if (color=2) {green(random(256)); delay(100);green(0);}
if (color=3) {blue(random(256)); delay(100);blue(0);}
   }


//-------------------------------------------------------------------------------------------//
//                                                                                           //
//                        Завершаем наш основной цикл  !!!                                   //
//                                                                                           //
//-------------------------------------------------------------------------------------------//

}

//***************************************************
void red(int s){
analogWrite (LED_R,255-s);
}
//***************************************************
void green(int s){
analogWrite (LED_G,255-s);
}
//***************************************************
void blue(int s){
analogWrite (LED_B,255-s);
}
